Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.CannotKeepAnalyticalAdjustment Property
 Analytical model Adjustment distance exceeds current Adjustment Snapping Distance. To adjust snap settings, go to the Structural Settings Dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepAnalyticalAdjustment { get; }
Public Shared ReadOnly Property CannotKeepAnalyticalAdjustment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepAnalyticalAdjustment {
	FailureDefinitionId^ get ();
}
static member CannotKeepAnalyticalAdjustment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace